Library/app/Models/Book_model.php

    public function getBookInfo(): array
    {
        return $this->findAll(); // Retrieve all Book records
---
SELECT *
FROM `book`

    public function getBookById(int $id): ?array
    {
        return $this->find($id); // Retrieve a Book record by ID
---
SELECT *
FROM `book`
WHERE `book`.`id` = 2

    public function updateBookRecord(int $id, array $data): bool
    {
        return $this->update($id, $data); // Update a Book record by ID
---
UPDATE `book` SET `name` = 'asdfasdsdafasdf234432', `qty` = 6, `price` = '99.99', `description` = 'sdfsadf'
WHERE `book`.`id` IN (2)