Library/app/Models/Cart_model.php

    public function getCartItemById(int $id): ?array
    {
        return $this->find($id); // Retrieve a cart item by ID
---
SELECT *
FROM `cart`
WHERE `cart`.`id` = 36

    public function insertCartItem(array $data): bool
    {
        return $this->insert($data); // Insert a new cart item
---
INSERT INTO `cart` (`book_id`, `user_id`, `quantity`) VALUES ('2', '23', '1')

    public function deleteCartItem(int $id): bool
    {
        return $this->delete($id); // Delete a cart item by ID
---
DELETE FROM `cart`
WHERE `id` IN (36)